<!DOCTYPE html>
    <html lang="en">
    <head>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <title>Document</title>
    </head>
    <body>
        <?php
            $gor=[
                    '1'=>[
                        'овен'=>'вам повезет','телец'=>'вам не повезет','близнецы'=>'вам повезет',
                        'рак'=>'вам не повезет','лев'=>'вам повезет','дева'=>'вам не повезет',
                        'весы'=>'вам повезет','скорпион'=>'вам не повезет','стрелец'=>'вам не повезет',
                        'козерог'=>'вам не повезет','водолей'=>'вам не повезет','рыбы'=>'вам повезет'
                    ],
                    '2'=>[
                        'овен'=>'вам не повезет','телец'=>'вам повезет','близнецы'=>'вам не повезет',
                        'рак'=>'вам не повезет','лев'=>'вам повезет','дева'=>'вам повезет',
                        'весы'=>'вам не повезет','скорпион'=>'вам повезет','стрелец'=>'вам повезет',
                        'козерог'=>'вам повезет','водолей'=>'вам не повезет','рыбы'=>'вам не повезет'
                    ],
                    '3'=>[
                        'овен'=>'вам не повезет','телец'=>'вам повезет','близнецы'=>'вам повезет',
                        'рак'=>'вам не повезет','лев'=>'вам повезет','дева'=>'вам не повезет',
                        'весы'=>'вам повезет','скорпион'=>'вам повезет','стрелец'=>'вам не повезет',
                        'козерог'=>'вам не повезет','водолей'=>'вам повезет','рыбы'=>'вам не повезет'
                    ],
                    '4'=>[
                        'овен'=>'вам повезет','телец'=>'вам повезет','близнецы'=>'вам повезет',
                        'рак'=>'вам не повезет','лев'=>'вам не повезет','дева'=>'вам не повезет',
                        'весы'=>'вам повезет','скорпион'=>'вам повезет','стрелец'=>'вам не повезет',
                        'козерог'=>'вам не повезет','водолей'=>'вам не повезет','рыбы'=>'вам повезет'
                    ],
                    '5'=>[
                        'овен'=>'вам повезет','телец'=>'вам не повезет','близнецы'=>'вам не повезет',
                        'рак'=>'вам повезет','лев'=>'вам не повезет','дева'=>'вам повезет',
                        'весы'=>'вам повезет','скорпион'=>'вам не повезет','стрелец'=>'вам не повезет',
                        'козерог'=>'вам не повезет','водолей'=>'вам повезет','рыбы'=>'вам не повезет'
                    ],
                    '6'=>[
                        'овен'=>'вам не повезет','телец'=>'вам не повезет','близнецы'=>'вам повезет',
                        'рак'=>'вам повезет','лев'=>'вам не повезет','дева'=>'вам повезет',
                        'весы'=>'вам повезет','скорпион'=>'вам не повезет','стрелец'=>'вам повезет',
                        'козерог'=>'вам не повезет','водолей'=>'вам не повезет','рыбы'=>'вам повезет'
                    ],
                    '7'=>[
                        'овен'=>'вам повезет','телец'=>'вам не повезет','близнецы'=>'вам не повезет',
                        'рак'=>'вам повезет','лев'=>'вам повезет','дева'=>'вам не повезет',
                        'весы'=>'вам повезет','скорпион'=>'вам повезет','стрелец'=>'вам не повезет',
                        'козерог'=>'вам повезет','водолей'=>'вам повезет','рыбы'=>'вам повезет'
                    ]

                    ];
            if(empty($_POST)){   
         ?>
         <h1>Гороскоп</h1>
        <form action="" method="post">
            <h3>Введите год рождения</h3>
            <p><input type="number" name="day" min="1" max="31"> День</p>
            <p><input type="number" name="month" min="1" max="12"> Месяц</p>
            <p><input type="number" name="year" min="1930" max="2022"> Год</p>
            <h3>Выберите день недели</h3>
            <select name="week">
                <option value="1">Понедельник</option>
                <option value="2">Вторник</option>
                <option value="3">Среда</option>
                <option value="4">Четверк</option>
                <option value="5">Пятница</option>
                <option value="6">Суббота</option>
                <option value="7">Воскресенье</option>
            </select>
            <p>
                <input type="submit" vakue="Отправить">
            </p>
        </form>
        <?php
            }else{
                $mygor='';
                if(($_POST['day']>20 && $_POST['month']==3)||($_POST['day']<21 && $_POST['month']==4)){
                    $mygor='овен';
                }
                if(($_POST['day']>20 && $_POST['month']==4)||($_POST['day']<22 && $_POST['month']==5)){
                    $mygor='телец';
                }
                if(($_POST['day']>21 && $_POST['month']==5)||($_POST['day']<22 && $_POST['month']==6)){
                    $mygor='близнецы';
                }
                if(($_POST['day']>21 && $_POST['month']==6)||($_POST['day']<23 && $_POST['month']==7)){
                    $mygor='рак';
                }
                if(($_POST['day']>22 && $_POST['month']==7)||($_POST['day']<22 && $_POST['month']==8)){
                    $mygor='лев';
                }
                if(($_POST['day']>21 && $_POST['month']==8)||($_POST['day']<24 && $_POST['month']==9)){
                    $mygor='дева';
                }
                if(($_POST['day']>23 && $_POST['month']==9)||($_POST['day']<24 && $_POST['month']==10)){
                    $mygor='весы';
                }
                if(($_POST['day']>23 && $_POST['month']==10)||($_POST['day']<23 && $_POST['month']==11)){
                    $mygor='скорпион';
                }
                if(($_POST['day']>22 && $_POST['month']==11)||($_POST['day']<23 && $_POST['month']==12)){
                    $mygor='стрелец';
                }
                if(($_POST['day']>22 && $_POST['month']==12)||($_POST['day']<21 && $_POST['month']==1)){
                    $mygor='козерог';
                }
                if(($_POST['day']>20 && $_POST['month']==1)||($_POST['day']<20 && $_POST['month']==2)){
                    $mygor='водолей';
                }
                if(($_POST['day']>19 && $_POST['month']==2)||($_POST['day']<21 && $_POST['month']==3)){
                    $mygor='рыбы';
                }
                foreach($gor as $k=>$v){
                    if($k==$_POST['week']){
                        foreach($v as $k2=>$v2){
                            if($mygor==$k2){
                                echo'<h2>Ваш знак зодиака '.$mygor.'</h2><p>В этот день недели '.$v2.'</p>';
                            }
                        }
                    }
                }
            } 
         ?>
    </body>
</html>